{
    "publications" : [
        {
            "id": "1",
            "title": "Conditional Generative Adversarial Networks: Introduction and Application",
            "authors": "Yichen Ding and Siqi Guo",
            "abstract": "Conditional Generative Adversarial Networks (GANs) play an important role in the field of computer vision. Its strength not only lies in its stronger feature extraction ability than traditional algorithms but also has achieved unprecedented success in the mutual game method of two different neural networks. The so-called dual network in GAN is called generator and discriminator. The generator generates a picture close to the expected value by inputting the deep learning network. The discriminator judges whether the image generated by the generator is true. Therefore, the mutual training purpose of the two models is to generate high-quality images infinitely close to the specified features. This paper mainly analyzes the basic network structure of Conditional GAN and its practical application in the fields of image generation, image style transformation, font style transformation, and natural language processing. Different branches of Conditional GAN and optimization methods such as InfoGAN, CycleGAN, StackGAN, McGAN, Conditional SeqGAN are also described. In general, GAN has an unprecedented impact on computer vision and image processing with NLP. At the same time, it also has great potential for future development.",
            "paperurl": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/12348/2641409/Conditional-generative-adversarial-networks-introduction-and-application/10.1117/12.2641409.short",
            "venue": "2nd International Conference on Artificial Intelligence, Automation, and High-Performance Computing (AIAHPC)",
            "year": "2022",
            "date": "2022-11-10",
            "bib": "@inproceedings{10.1117/12.2641409,\nauthor = {Yichen Ding and Siqi Guo},\ntitle = {{Conditional generative adversarial networks: introduction and application}},\nvolume = {12348},\nbooktitle = {2nd International Conference on Artificial Intelligence, Automation, and High-Performance Computing (AIAHPC 2022)},\neditor = {Ligu Zhu},\norganization = {International Society for Optics and Photonics},\npublisher = {SPIE},\npages = {1234811},\nyear = {2022},\ndoi = {10.1117/12.2641409},\nURL = {https://doi.org/10.1117/12.2641409}\n}"
        },
        {
            "id": "2",
            "title": "Local-Global Defense against Unsupervised Adversarial Attacks on Graphs",
            "authors": "Jin, D., Feng, B., Guo, S., Wang, X., Wei, J., & Wang, Z.",
            "abstract": "Unsupervised pre-training algorithms for graph representation learning are vulnerable to adversarial attacks, such as first-order perturbations on graphs, which will have an impact on particular downstream applications. Designing an effective representation learning strategy against white-box attacks remains a crucial open topic. Prior research attempts to improve representation robustness by maximizing mutual information between the representation and the perturbed graph, which is suboptimal because it does not adapt its defense techniques to the severity of the attack. To address this issue, we propose an unsupervised defense method that combines local and global defense to improve the robustness of representation. Note that we put forward the Perturbed Edges Harmfulness (PEH) metric to determine the riskiness of the attack. Thus, when the edges are attacked, the model can automatically identify the risk of attack. We present a method of attention-based protection against high-risk attacks that penalizes attention coefficients of perturbed edges to encoders. Extensive experiments demonstrate that our strategies can enhance the robustness of representation against various adversarial attacks on three benchmark graphs.",
            "paperurl": "https://ojs.aaai.org/index.php/AAAI/article/view/25979",
            "venue": "Proceedings of the AAAI Conference on Artificial Intelligence, 37",
            "year": "2023",
            "date": "2023-06-26",
            "bib": "@article{Jin_Feng_Guo_Wang_Wei_Wang_2023,\ntitle={Local-Global Defense against Unsupervised Adversarial Attacks on Graphs},\nvolume={37},\nurl={https://ojs.aaai.org/index.php/AAAI/article/view/25979},\nDOI={10.1609/aaai.v37i7.25979},\nnumber={7},\njournal={Proceedings of the AAAI Conference on Artificial Intelligence},\nauthor={Jin, Di and Feng, Bingdao and Guo, Siqi and Wang, Xiaobao and Wei, Jianguo and Wang, Zhen},\nyear={2023},\nmonth={Jun.},\npages={8105-8113}\n}"
        }
    ]
}